//CAPREACT JOB 1,NOTIFY=&SYSUID
//***************************************************/
//COBRUN  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(CAPREACT),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(CAPREACT),DISP=SHR
//***************************************************/
