//ESCAPE   JOB 1,NOTIFY=&SYSUID
//***************************************************/
//COBRUN  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(ESCAPE),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(ESCAPE),DISP=SHR
