//FAGP JOB 1,NOTIFY=&SYSUID
//***************************************************/
//COBRUN  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(FAGP),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(FAGP),DISP=SHR
//***************************************************/
