//FPGA JOB 1,NOTIFY=&SYSUID
//***************************************************/
//COBRUN  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(FPGA),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(FPGA),DISP=SHR
//***************************************************/
