//FPGF JOB 1,NOTIFY=&SYSUID
//***************************************************/
//COBRUN  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(FPGF),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(FPGF),DISP=SHR
//***************************************************/
