//THRMST3K JOB 1,NOTIFY=&SYSUID
//***************************************************/
//COBRUN  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(THRMST3K),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(THRMST3K),DISP=SHR
//***************************************************/
